Catalogs/ФакторыРиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФакторыРиска</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Баллы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможенВыборНесколькихДочернихЭлементов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФакторыРиска/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СправочникПустой() Тогда
		Ответ = Вопрос("Заполнить справочник?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаполнитьСправочникНаСервере();
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочникНаСервере()
	
	Макет = Справочники.ФакторыРиска.ПолучитьМакет("ДанныеДляЗаполненияСправочника");
	Группа = Неопределено;
	Подгруппа = Неопределено;
	
	Для строка = 2 По Макет.ВысотаТаблицы Цикл
		
		Объект = Справочники.ФакторыРиска.СоздатьЭлемент();
		Объект.Наименование = Макет.Область("R" + строка + "C2").Текст;
		Объект.Баллы = Макет.Область("R" + строка + "C3").Текст;
		
		Если Макет.Область("R" + строка + "C4").Текст = "+" Тогда
			Объект.ВозможенВыборНесколькихДочернихЭлементов = Истина;
		Иначе
			Объект.ВозможенВыборНесколькихДочернихЭлементов = Ложь;
		КонецЕсли;
		
		Если Макет.Область("R" + строка + "C1").Текст = "1" Тогда
			Объект.Родитель = Группа;
		ИначеЕсли Макет.Область("R" + строка + "C1").Текст = "2" Тогда
			Объект.Родитель = Подгруппа;
		КонецЕсли;
		
		Объект.Записать();
		
		Если Макет.Область("R" + строка + "C1").Текст = "0" Тогда
			Группа = Объект.Ссылка;	
		ИначеЕсли Макет.Область("R" + строка + "C1").Текст = "1" Тогда
			Подгруппа = Объект.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СправочникПустой()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФакторыРиска.Ссылка
		|ИЗ
		|	Справочник.ФакторыРиска КАК ФакторыРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
